<template>
  <div>
    <el-dialog
      width="800px"
      title="疗休养协议"
      top="6vh"
      :visible="dialogXieyi"
      @close="closeDialog"
      @open="openDialog"
      custom-class="demo-dialog"
      :close-on-click-modal="false"
    >
    <div :style="{height:clientHeight+'px'}" class="xieyidialog">
      <h3>请仔细阅读以下协议</h3>
      <article class="xieyi">
           <span>   为深入学习贯彻习近平总书记在庆祝改革开放40周年大会上的重要讲话精神，激励广大师生团结奋进，改革创新，勇争一流，12月21日上午，学校在大礼堂贵宾厅召开以“致敬改革者 奋进新时代”为主题的庆祝改革开放40周年座谈会。老领导陈之航、汤亚栋、周鹏飞、吴益和、伍贻文、何建中、白苏娣、张仁杰，退休教师代表车宏安教授，杰出校友代表王山出席，学校党委班子成员、中层正职干部、师生代表参加会议。学校以党委理论学习中心组集体学习研讨的形式，邀请老中青三代上理人齐聚一堂，共同分享学习习总书记重要讲话精神的体会，回顾学校过去40年改革开放的奋斗历程和发展经验，共话学校在新时代改革开放再出发的思考和认识。会议由校党委副书记、纪委书记刘道平主持。
        上午，大礼堂前草坪上人头攒动，众多老领导、老同志和师生代表认真观看“弦歌不辍沪江潮 扬帆奋进新时代”——学校庆祝改革开放40周年图片展。步入大礼堂贵宾厅，耳旁传来《春天的故事》、《不忘初心》等经典歌声立刻勾起人们的时代回忆。会场内布置一新，会场正中央“‘致敬改革者 奋进新时代’——上海理工大学庆祝改革开放40周年座谈会”的会标在金色吊灯灯光的映照下格外显眼。
        </span><br> <span>    座谈会开始前，青年学生代表满怀着对老前辈们的崇敬之情，向为学校改革事业发展做出贡献的老领导、老同志献花。在座谈交流环节，老领导、老同志、校友代表、师生代表先后发言。大家表示，观看收听习总书记的重要讲话，令人振奋，充满信心。在党的领导下，过去40年国家发生了翻天覆地的变化，学校也发生了巨大的变化，而且学校一直与国家的发展同向同行。大家动情地讲到，作为参与者、见证者、受益者，上理人始终凭借着敢为人先、勇立潮头的精神，坚持改革创新，大胆闯、勇敢改，取得了显著成就。从70年代全国首创系统工程班到现在系统学科全国排名第三，80年代成为全国首批研究生学位授予单位，实现从硕士、博士到博士后培养“三级跳”，以及率先开展工程教育国际化办学，再到90年代率先探索学分制改革和教育成本管理，率先开展后勤社会化改革，率先开展校院两级体制管理改革，进入新世纪，学校传承工程特色、坚持包融发展、深化改革创新、服务产业进步，取得辉煌成就，2018年学校顺利进入上海地方高水平建设试点单位，为学校的改革发展赢来了难得的战略机遇。40年来，学校在党的建设、教学科研、人才培养、社会服务、校园文化、国际交流与合作、基本建设等方面都取得了长足的进步，做了许多开风气之先的壮举，为社会培养了一大批有用之才，这值得每一个上理人骄傲和自豪。大家对学校未来的发展充满希望，相信在学校党委的领导下，上理人团结一致，奋发向前，在改革开放的接力赛中，每一棒都能跑出好成绩，而且一棒更比一棒好，通过不断加快高水平大学建设，创造出让师生校友、上海乃至全国人民刮目相看的成就。
        校长丁晓东发表了热情洋溢的讲话。他援引1978年郭沫若在全国科学技术大会上的演讲“这是革命的春天，这是人民的春天，这是科学的春天！”指出，改革开放给广大知识分子送来了“科学的春天”。40年的成就是巨大的，其宝贵经验也正如习近平总书记在庆祝改革开放40周年大会上所讲到的，要始终坚持党的领导。他回顾了2007-2012年在校工作期间学校改革发展的历程，指出正是因为坚持改革创新学校才能在卓越工程教育、校园空间和面貌、学科发展规划、现代大学制度建设等方面取得日新月异的发展。他表示在改革开放40周年之际,再次成为上理人深感肩上责任重大。2018年学校成功举行第八次党代会，进一步绘就未来发展蓝图，我们要切实把习总书记重要讲话精神全面贯彻到高水平大学建设的各项工作中，要在党委坚强领导下，继续高举改革开放大旗，紧紧抓住高水平大学建设的重要机遇，趁势而上，进一步彰显学科特色，强化为国家和上海发展战略服务，要扎实开展好本科教育思想大讨论，探讨建设新形势下的新工科人才培养模式，要大力推进人才强校主战略，通过引育并举培养高素质的师资队伍，要加快推进温馨和谐校园建设，为师生营造更加优质的学习生活环境，全校上下要同奋斗、共进步，以更大作为，更大贡献写好新时代高等教育改革发展的“奋进之笔”。
        校党委书记吴松作总结讲话。他首先代表学校党委对各级领导，向历任老领导、离退休老同志，向全校师生员工和海内外校友，向所有关心支持学校事业发展的社会各界表示崇高敬意和衷心感谢。他表示，习总书记的重要讲话为新时代推动改革开放再出发指明了前进方向，提供了根本遵循，彰显了我们党坚持改革开放的坚定决心，劈波斩浪的恒心和和以人民为中心的初心。全校师生员工，尤其是党员干部要深刻学习领会习总书记重要讲话精神，把思想和行动统一到讲话的精神上来。努力在学懂弄通做实上下功夫，让学习成为一种工作方式，成为一种生活态度。他指出，总书记在讲话中强调，伟大梦想不是等得来、喊得来的，而是拼出来、干出来的。在千帆竞发、百舸争流的时代，绝不能有半点骄傲自满、固步自封，也绝不能有丝毫的犹豫不决、徘徊彷徨，必须勇立潮头、奋勇搏击。我们要大力弘扬伟大奋斗精神，奋进新时代，改革再出发，让我们紧密团结在以习近平同志为核心的党中央周围，牢固树立“四个意识”，坚定“四个自信”，坚决做到“两个维护”，在习近平新时代中国特色社会主义思想指引下，沿着学校第八次党代会规划的“三步走”的宏伟目标，同心同德，砥砺前行，为建设引领产业技术进步的创新型大学、进而建成特色显著的一流理工科大学的目标而努力奋斗！
        </span> <br><span>     为贯彻全国教育大会精神，进一步构建全员全过程全方位协同育人格局，充分发挥学生在学校治理中的积极作用。2018年第18次校长办公会决定实施“学生校长助理”计划。经过为期大半年的选拔，通过笔试、面试、试用期考核、终期答辩等环节，结合学院政审意见，共选拔出8名学生校长助理。
        </span><br>1月4日上午，学校首届学生校长助理聘任仪式暨校长与学生校长助理座谈会在校办206会议室举行。校长丁晓东，党委副书记、副校长盛春，党委（校长）办公室、研究生院、研工部、学工部、教务处、后勤处、团委等部门负责人及首届学生校长助理出席。会议由盛春主持。
        <br><span> 党委（校长）办公室主任刘彬介绍学生校长助理的遴选过程并宣读聘任决议。丁晓东为杨欣悦、江嘉宇、王雪丽、刘建昆、韩梦莹、王绍峰、张依婧、黄睿涵8名学生校长助理颁发聘书。学生校长助理依次作了交流发言，从学生对导师、班主任、后勤服务、教室环境等方面的期待，学生利益需求的特征等方面汇报了调研成果。与会人员就同学们关心的问题和调研内容等进行了深入交流与讨论。同时，各职能部门负责人表示将全力支持配合学生校长助理开展各方面工作，为学生的发展和学校的高水平建设奉献智慧和力量。
        丁晓东作总结讲话。他指出，学生校长助理是为学生提供一个锻炼发展的综合学习平台，助理们要注重培养善于观察、善于学习、善于分析、善于表达的能力及大局意识和宏观意识。他强调，学生校长助理既代表学校官方，也代表学生，要为双方发声，主动作为，积极参与到解决学校、学生各方面问题中去。他对学生校长助理今后的履职提出了五点要求：一是要深入学习习近平新时代中国特色社会主义思想，坚持用辩证唯物主义的方法思考问题，始终坚守正确的立场；二是要保持青春活力和无畏精神，保持永远奋斗的精神状态；三是要珍惜所处的美好时代，做一个拥有家国情怀的人，坚持立足中国、面向世界，包融发展；四是要相信真理，对问题要综合研判，做到敢说敢做敢担当；五是要树立发展是第一要务的意识，用发展的眼光看问题，携手师生共同推动学校高水平大学建设。
        </span><br><span>    学生校长助理责任光荣、使命重大。学生校长助理们表示将不忘初心，不辜负学校领导的殷切期望，在新时代高水平大学的建设中，为学校的发展做出应有的贡献。作为服务学生成长、助力学校发展的“小参谋、小助手、小桥梁”，学生校长助理将积极参与到学校事业发展及重要决策之中、维护学生合法权益，做好学校与学生沟通的联络者，为上海理工大学建设特色显著的一流理工科大学奉献青春力量。
        <br>12月5日上午，上海市教委主任陆靖率领相关处室负责同志一行7人莅临中国（上海）创业者公共实训基地和上海理工大学国家大学科技园，现场调研基地和园区中上海理工大学的大学生中小微创业企业。校党委书记吴松，校党委副书记、副校长盛春，副校长张华以及相关职能部处负责人陪同调研。
        在中国（上海）创业者公共实训基地，创业部部长尚蓉先介绍了基地整体发展情况。调研组一行分别考察了位于基地四号楼的上海微漾文化传播有限公司和基地创业苗圃、位于基地一号楼的基地创意平台和上海胧爱文化传播有限公司。
        在上海理工大学科技园，调研组分别考察了上海毕得医药科技有限公司、沈机（上海）智能系统研发设计有限公司和上海迪安医学检验所有限公司，相关企业负责人介绍了企业发展的基本情况。
        上海市教委领导一行与我校领导及大学生中小微创业企业代表等举行座谈会。市教委主任陆靖介绍了此次调研的目的是落实市委市政府关心中小微企业营商环境的决策，了解中小微创新创业发展过程中发展痛点问题，了解上海的教育能够为大学生在创业过程中提供哪些更优化的服务等。
        校党委书记吴松首先对市教委领导关心大学生创业企业发展，特别是对上海理工大学创新创业教育的支持表达了衷心感谢。上海理工大学国家大学科技园总经理荆勇就园区现有的整体情况作了详细汇报，并表示上理工科技园将继续坚持品牌输出，通过学科优势带动产业，建立新形势下的服务体系，打造环上理工创新创业街区。
        随后，上海华之邦科技股份有限公司总经理陈宝明、上海罗富蒂曼电站设备有限公司总经理马子安、上海迪安医学检验所有限公司总经理李丽、上海精智实业股份有限公司副总裁周杰文、上海胧爱文化传播有限公司总经理蒋公宝、上海庭赫信息科技有限公司总经理张庭赫、上海石石信息科技有限公司总经理朱一、上海理工大学智能猫箱联合创始人李雨莳、上海微漾文化传播有限公司总经理刘宇、上海裕豪信息科技有限责任公司总经理牟莹、上海悠理环境科技有限公司总经理刘伟等11家从上海理工大学走出去的大学生创业企业负责人分别发言，集中反应了目前中小微企业银行贷款难、因落户困难和高住房成本造成企业留不住人才、中小微创业企业税收优惠政策落实不到位、个人专利转化为公司所用的政策支持难等现实问题；同时，他们也提出了期待政府出台相关中小微企业产业融合做大做强的引导政策、对中小微企业科创版上市优惠政策支持、拓宽中小微企业与高校强势学科合作的渠道、出台上海电竞产业的扶持政策等建议；最后，他们对于上理工多年来关心学生创业企业发展以及给与多方面的持续支持表达了衷心感谢。
      </span></article>
      <div class="underbut">
      <el-checkbox v-model="checked">我同意以上协议</el-checkbox>
      <el-button type="primary" @click="submit">确定</el-button></div>
      </div>
    </el-dialog>
  </div>
</template>
<script>
import { mapState} from 'vuex'
export default {
    props:['dialogXieyi'],
  data() {
    return {
    //   dialogXieyi: true,
      checked: false
    };
  },
  computed:{
...mapState([]),
clientHeight() {
      return this.$store.state.clientHeight - 115;
    }
  },
  methods: {
      openDialog(){

      },
    closeDialog() {
   this.$emit("CB_dialogXieyi",false)
    },
    submit(){
      console.log(this.checked)}
  }
};
</script>
<style>
.demo-dialog .el-dialog__body{
    padding: 30px 0px 30px 20px
}
.xieyi{
    line-height: 23px;
    font-family: cursive
}
.xieyidialog{
    overflow-y: scroll;
    padding-right: 10px
}
.underbut{
    margin-top: 20px
}
.underbut button{
    float: right
}
</style>
